---
kind: type
id: T:Autodesk.Revit.UI.IIFCEntityTreeUIServer
source: html/b14bf5c2-a04b-e616-1844-c7eb22553d86.htm
---
# Autodesk.Revit.UI.IIFCEntityTreeUIServer

The interface used to provide UI on IFC Entity selection.

## Syntax (C#)
```csharp
public interface IIFCEntityTreeUIServer : IExternalServer
```